import pytest

from src.widget import get_date, mask_account_card


# проверка положительного исхода
@pytest.mark.parametrize(
    "correct_data, expected",
    [
        ("Maestro 1596837868705199", "Maestro 1596 83** **** 5199"),
        ("Visa Classic 6831982476737658", "Visa Classic 6831 98** **** 7658"),
        ("Visa Platinum 8990922113665229", "Visa Platinum 8990 92** **** 5229"),
        ("Visa Gold 5999414228426353", "Visa Gold 5999 41** **** 6353"),
        ("Счет 35383033474447895560", "Счет **5560"),
        ("Счет 73654108430135874305", "Счет **4305"),
    ],
)
def test_mask_account_card(correct_data, expected):
    assert mask_account_card(correct_data) == expected


# проверка ввода некорректных данных
@pytest.mark.parametrize(
    "incorrect_data, expected",
    [
        ("Maestro 1596837868705199000", "Вы ввели неверное количество цифр карты"),
        ("Visa Classic 6831982476", "Вы ввели неверное количество цифр карты"),
        ("Visa Platinum 899", "Вы ввели неверное количество цифр карты"),
        ("Visa Gold 59994142284263530", "Вы ввели неверное количество цифр карты"),
        ("Счет 353830334744478955600000", "Вы ввели неверное количество цифр счета"),
        ("Счет 736541084301358743", "Вы ввели неверное количество цифр счета"),
    ],
)
def test_mask_account_card_invalid_number(incorrect_data, expected):
    with pytest.raises(ValueError) as exc_info:
        mask_account_card(incorrect_data)
    # Проверяем, что сообщение об ошибке соответствует ожидаемому
    assert str(exc_info.value) == expected


# проверка положительного исхода
@pytest.mark.parametrize(
    "correct_date, expected",
    [
        ("2024-01-01T00:00:00.000000", "01.01.2024"),  # первое января
        ("2024-12-31T23:59:59.999999", "31.12.2024"),  # последний день года
        ("2024-12-31T23:59:59.999999", "31.12.2024"),  # граничная дата года
    ],
)
def test_get_date(correct_date, expected):
    assert get_date(correct_date) == expected


# проверка ввода некорректных данных
@pytest.mark.parametrize(
    "incorrect_date, expected",
    [
        ("2024-03-11T02:26:18.6714070", "Вы ввели неверное количество символов"),  # символов больше нужного
        ("2024-03-11T02:26:18.67140", "Вы ввели неверное количество символов"),  # символов меньше нужного
        ("20240311T02:26:18.671407", "Некорректно указан формат входных данных"),
        ("2024-03-11T022618.671407", "Некорректно указан формат входных данных"),
        ("2024-03-11T02:26:18671407", "Некорректно указан формат входных данных"),
        ("2024-03-1102:26:18.671407", "Некорректно указан формат входных данных"),
        ("2025-02-29T02:26:18.671407", "Это не високосный год. В феврале не может быть больше 28 дней"),
        ("2024-04-31T02:26:18.671407", "В данном месяце не может быть больше 30 дней"),
        ("", "Вы ничего не ввели"),
        ("2024-03-00T02:26:18.671407", "День указан неверно"),
        ("2024-03-32T02:26:18.671407", "В данном месяце не может быть больше 31 дня"),
        ("2024-00-11T02:26:18.671407", "Месяц указан неверно"),
        ("2024-13-11T02:26:18.671407", "Месяц указан неверно"),
        ("0000-03-11T02:26:18.671407", "Год указан неверно"),
        ("9001-03-11T02:26:18.671407", "Год указан неверно"),
    ],
)
def test_get_date_invalid_date(incorrect_date, expected):
    with pytest.raises(ValueError) as exc_info:
        get_date(incorrect_date)
    # Проверяем, что сообщение об ошибке соответствует ожидаемому
    assert str(exc_info.value) == expected
